# CannotSwitchToCurtainWall Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CurtainWallFailures..::..CannotSwitchToCurtainWall Property
BuiltInFailures..::..CurtainWallFailures Class See Also
---
Can't switch type to Curtain Wall after Edit Elevation Profile.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotSwitchToCurtainWall { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotSwitchToCurtainWall As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotSwitchToCurtainWall {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CurtainWallFailures Class
Autodesk.Revit.DB Namespace